RT-Thread/rt-thread/bsp/fm33lg026/libraries/FM33LG0xx_FL_Driver/Inc/fm33lg0xx_fl_cmu.h
#define    CMU_PLLCR_LOCKED_Pos                                   (7U)
#define    CMU_PLLCR_LOCKED_Msk                                   (0x1U << CMU_PLLCR_LOCKED_Pos)
#define    CMU_PLLCR_LOCKED                                       CMU_PLLCR_LOCKED_Msk

#define    CMU_PLLCR_INSEL_Pos                                    (1U)
#define    CMU_PLLCR_INSEL_Msk                                    (0x1U << CMU_PLLCR_INSEL_Pos)
#define    CMU_PLLCR_INSEL                                        CMU_PLLCR_INSEL_Msk

#define    CMU_PLLCR_DB_Pos                                       (16U)
#define    CMU_PLLCR_DB_Msk                                       (0x7fU << CMU_PLLCR_DB_Pos)
#define    CMU_PLLCR_DB                                           CMU_PLLCR_DB_Msk

#define    CMU_PLLCR_REFPRSC_Pos                                  (4U)
#define    CMU_PLLCR_REFPRSC_Msk                                  (0x7U << CMU_PLLCR_REFPRSC_Pos)
#define    CMU_PLLCR_REFPRSC                                      CMU_PLLCR_REFPRSC_Msk

#define    CMU_PLLCR_OSEL_Pos                                     (3U)
#define    CMU_PLLCR_OSEL_Msk                                     (0x1U << CMU_PLLCR_OSEL_Pos)
#define    CMU_PLLCR_OSEL                                         CMU_PLLCR_OSEL_Msk

#define    CMU_RCLPCR_ENB_Pos                                     (0U)
#define    CMU_RCLPCR_ENB_Msk                                     (0x1U << CMU_RCLPCR_ENB_Pos)
#define    CMU_RCLPCR_ENB                                         CMU_RCLPCR_ENB_Msk

#define    CMU_RCLPTR_TRIM_Pos                                    (0U)
#define    CMU_RCLPTR_TRIM_Msk                                    (0xffU << CMU_RCLPTR_TRIM_Pos)
#define    CMU_RCLPTR_TRIM                                        CMU_RCLPTR_TRIM_Msk

#define    CMU_LSCLKSEL_SEL_Pos                                   (0U)
#define    CMU_LSCLKSEL_SEL_Msk                                   (0xffU << CMU_LSCLKSEL_SEL_Pos)
#define    CMU_LSCLKSEL_SEL                                       CMU_LSCLKSEL_SEL_Msk

#define    CMU_XTHFCR_CFG_Pos                                     (8U)
#define    CMU_XTHFCR_CFG_Msk                                     (0x1fU << CMU_XTHFCR_CFG_Pos)
#define    CMU_XTHFCR_CFG                                         CMU_XTHFCR_CFG_Msk

#define    CMU_XTHFCR_EN_Pos                                      (0U)
#define    CMU_XTHFCR_EN_Msk                                      (0x1U << CMU_XTHFCR_EN_Pos)
#define    CMU_XTHFCR_EN                                          CMU_XTHFCR_EN_Msk

#define    CMU_RCLFCR_PSC_Pos                                     (16U)
#define    CMU_RCLFCR_PSC_Msk                                     (0x3U << CMU_RCLFCR_PSC_Pos)
#define    CMU_RCLFCR_PSC                                         CMU_RCLFCR_PSC_Msk

#define    CMU_RCLFCR_EN_Pos                                      (0U)
#define    CMU_RCLFCR_EN_Msk                                      (0x1U << CMU_RCLFCR_EN_Pos)
#define    CMU_RCLFCR_EN                                          CMU_RCLFCR_EN_Msk

#define    CMU_RCLFTR_TRIM_Pos                                    (0U)
#define    CMU_RCLFTR_TRIM_Msk                                    (0xffU << CMU_RCLFTR_TRIM_Pos)
#define    CMU_RCLFTR_TRIM                                        CMU_RCLFTR_TRIM_Msk

#define    CMU_OPCCR1_EXTICKS_Pos                                 (30U)
#define    CMU_OPCCR1_EXTICKS_Msk                                 (0x1U << CMU_OPCCR1_EXTICKS_Pos)
#define    CMU_OPCCR1_EXTICKS                                     CMU_OPCCR1_EXTICKS_Msk

#define    CMU_OPCCR1_LPUART1CKS_Pos                              (26U)
#define    CMU_OPCCR1_LPUART1CKS_Msk                              (0x3U << CMU_OPCCR1_LPUART1CKS_Pos)
#define    CMU_OPCCR1_LPUART1CKS                                  CMU_OPCCR1_LPUART1CKS_Msk

#define    CMU_OPCCR1_LPUART0CKS_Pos                              (24U)
#define    CMU_OPCCR1_LPUART0CKS_Msk                              (0x3U << CMU_OPCCR1_LPUART0CKS_Pos)
#define    CMU_OPCCR1_LPUART0CKS                                  CMU_OPCCR1_LPUART0CKS_Msk

#define    CMU_OPCCR1_LPUART2CKS_Pos                              (22U)
#define    CMU_OPCCR1_LPUART2CKS_Msk                              (0x3U << CMU_OPCCR1_LPUART2CKS_Pos)
#define    CMU_OPCCR1_LPUART2CKS                                  CMU_OPCCR1_LPUART2CKS_Msk

#define    CMU_OPCCR1_I2CCKS_Pos                                  (16U)
#define    CMU_OPCCR1_I2CCKS_Msk                                  (0x3U << CMU_OPCCR1_I2CCKS_Pos)
#define    CMU_OPCCR1_I2CCKS                                      CMU_OPCCR1_I2CCKS_Msk

#define    CMU_OPCCR1_BT16CKS_Pos                                 (14U)
#define    CMU_OPCCR1_BT16CKS_Msk                                 (0x3U << CMU_OPCCR1_BT16CKS_Pos)
#define    CMU_OPCCR1_BT16CKS                                     CMU_OPCCR1_BT16CKS_Msk

#define    CMU_OPCCR1_BT32CKS_Pos                                 (12U)
#define    CMU_OPCCR1_BT32CKS_Msk                                 (0x3U << CMU_OPCCR1_BT32CKS_Pos)
#define    CMU_OPCCR1_BT32CKS                                     CMU_OPCCR1_BT32CKS_Msk

#define    CMU_OPCCR1_LPT16CKS_Pos                                (10U)
#define    CMU_OPCCR1_LPT16CKS_Msk                                (0x3U << CMU_OPCCR1_LPT16CKS_Pos)
#define    CMU_OPCCR1_LPT16CKS                                    CMU_OPCCR1_LPT16CKS_Msk

#define    CMU_OPCCR1_LPT32CKS_Pos                                (8U)
#define    CMU_OPCCR1_LPT32CKS_Msk                                (0x3U << CMU_OPCCR1_LPT32CKS_Pos)
#define    CMU_OPCCR1_LPT32CKS                                    CMU_OPCCR1_LPT32CKS_Msk

#define    CMU_OPCCR1_ATCKS_Pos                                   (7U)
#define    CMU_OPCCR1_ATCKS_Msk                                   (0x1U << CMU_OPCCR1_ATCKS_Pos)
#define    CMU_OPCCR1_ATCKS                                       CMU_OPCCR1_ATCKS_Msk

#define    CMU_OPCCR1_CANCKS_Pos                                  (4U)
#define    CMU_OPCCR1_CANCKS_Msk                                  (0x3U << CMU_OPCCR1_CANCKS_Pos)
#define    CMU_OPCCR1_CANCKS                                      CMU_OPCCR1_CANCKS_Msk

