RT-Thread/rt-thread/bsp/fm33lg026/libraries/FM33LG0xx_FL_Driver/Inc/fm33lg0xx_fl_cmu.h
#define    FL_CMU_SYSTEM_CLK_SOURCE_RCHF                          (0x0U << CMU_SYSCLKCR_SYSCLKSEL_Pos)
#define    FL_CMU_SYSTEM_CLK_SOURCE_XTHF                          (0x1U << CMU_SYSCLKCR_SYSCLKSEL_Pos)
#define    FL_CMU_SYSTEM_CLK_SOURCE_PLL                           (0x2U << CMU_SYSCLKCR_SYSCLKSEL_Pos)
#define    FL_CMU_SYSTEM_CLK_SOURCE_RCLF                          (0x4U << CMU_SYSCLKCR_SYSCLKSEL_Pos)
#define    FL_CMU_SYSTEM_CLK_SOURCE_XTLF                          (0x5U << CMU_SYSCLKCR_SYSCLKSEL_Pos)
#define    FL_CMU_SYSTEM_CLK_SOURCE_RCLP                          (0x6U << CMU_SYSCLKCR_SYSCLKSEL_Pos)


#define    FL_CMU_RCHF_FREQUENCY_8MHZ                             (0x0U << CMU_RCHFCR_FSEL_Pos)
#define    FL_CMU_RCHF_FREQUENCY_16MHZ                            (0x1U << CMU_RCHFCR_FSEL_Pos)
#define    FL_CMU_RCHF_FREQUENCY_24MHZ                            (0x2U << CMU_RCHFCR_FSEL_Pos)
#define    FL_CMU_RCHF_FREQUENCY_32MHZ                            (0x3U << CMU_RCHFCR_FSEL_Pos)


#define    FL_CMU_PLL_CLK_SOURCE_RCHF                             (0x0U << CMU_PLLCR_INSEL_Pos)
#define    FL_CMU_PLL_CLK_SOURCE_XTHF                             (0x1U << CMU_PLLCR_INSEL_Pos)


#define    FL_CMU_PLL_PSC_DIV1                                    (0x0U << CMU_PLLCR_REFPRSC_Pos)
#define    FL_CMU_PLL_PSC_DIV2                                    (0x1U << CMU_PLLCR_REFPRSC_Pos)
#define    FL_CMU_PLL_PSC_DIV4                                    (0x2U << CMU_PLLCR_REFPRSC_Pos)
#define    FL_CMU_PLL_PSC_DIV8                                    (0x3U << CMU_PLLCR_REFPRSC_Pos)
#define    FL_CMU_PLL_PSC_DIV12                                   (0x4U << CMU_PLLCR_REFPRSC_Pos)
#define    FL_CMU_PLL_PSC_DIV16                                   (0x5U << CMU_PLLCR_REFPRSC_Pos)
#define    FL_CMU_PLL_PSC_DIV24                                   (0x6U << CMU_PLLCR_REFPRSC_Pos)
#define    FL_CMU_PLL_PSC_DIV32                                   (0x7U << CMU_PLLCR_REFPRSC_Pos)


#define    FL_CMU_PLL_OUTPUT_X1                                   (0x0U << CMU_PLLCR_OSEL_Pos)
#define    FL_CMU_PLL_OUTPUT_X2                                   (0x1U << CMU_PLLCR_OSEL_Pos)


#define    FL_CMU_LSCLK_CLK_SOURCE_RCLP                           (0x55U << CMU_LSCLKSEL_SEL_Pos)
#define    FL_CMU_LSCLK_CLK_SOURCE_XTLF                           (0xAAU << CMU_LSCLKSEL_SEL_Pos)

#define    FL_CMU_RCLF_PSC_DIV1                                   (0x0U << CMU_RCLFCR_PSC_Pos)
#define    FL_CMU_RCLF_PSC_DIV4                                   (0x1U << CMU_RCLFCR_PSC_Pos)
#define    FL_CMU_RCLF_PSC_DIV8                                   (0x2U << CMU_RCLFCR_PSC_Pos)
#define    FL_CMU_RCLF_PSC_DIV16                                  (0x3U << CMU_RCLFCR_PSC_Pos)


#define    FL_CMU_EXTI_CLK_SOURCE_LSCLK                           (0x1U << CMU_OPCCR1_EXTICKS_Pos)
#define    FL_CMU_EXTI_CLK_SOURCE_HCLK                            (0x0U << CMU_OPCCR1_EXTICKS_Pos)


#define    FL_CMU_LPUART1_CLK_SOURCE_LSCLK                        (0x0U << CMU_OPCCR1_LPUART1CKS_Pos)
#define    FL_CMU_LPUART1_CLK_SOURCE_RCHF                         (0x1U << CMU_OPCCR1_LPUART1CKS_Pos)
#define    FL_CMU_LPUART1_CLK_SOURCE_RCLF                         (0x2U << CMU_OPCCR1_LPUART1CKS_Pos)


#define    FL_CMU_LPUART0_CLK_SOURCE_LSCLK                        (0x0U << CMU_OPCCR1_LPUART0CKS_Pos)
#define    FL_CMU_LPUART0_CLK_SOURCE_RCHF                         (0x1U << CMU_OPCCR1_LPUART0CKS_Pos)
#define    FL_CMU_LPUART0_CLK_SOURCE_RCLF                         (0x2U << CMU_OPCCR1_LPUART0CKS_Pos)


#define    FL_CMU_LPUART2_CLK_SOURCE_LSCLK                        (0x0U << CMU_OPCCR1_LPUART2CKS_Pos)
#define    FL_CMU_LPUART2_CLK_SOURCE_RCHF                         (0x1U << CMU_OPCCR1_LPUART2CKS_Pos)
#define    FL_CMU_LPUART2_CLK_SOURCE_RCLF                         (0x2U << CMU_OPCCR1_LPUART2CKS_Pos)

#define    FL_CMU_LPUART_CLK_SOURCE_LSCLK                         (0x0U)
#define    FL_CMU_LPUART_CLK_SOURCE_RCHF                          (0x1U)
#define    FL_CMU_LPUART_CLK_SOURCE_RCLF                          (0x2U)


#define    FL_CMU_I2C_CLK_SOURCE_APBCLK                           (0x0U << CMU_OPCCR1_I2CCKS_Pos)
#define    FL_CMU_I2C_CLK_SOURCE_RCHF                             (0x1U << CMU_OPCCR1_I2CCKS_Pos)
#define    FL_CMU_I2C_CLK_SOURCE_SYSCLK                           (0x2U << CMU_OPCCR1_I2CCKS_Pos)
#define    FL_CMU_I2C_CLK_SOURCE_RCLF                             (0x3U << CMU_OPCCR1_I2CCKS_Pos)


#define    FL_CMU_BSTIM16_CLK_SOURCE_APBCLK                       (0x0U << CMU_OPCCR1_BT16CKS_Pos)
#define    FL_CMU_BSTIM16_CLK_SOURCE_LSCLK                        (0x1U << CMU_OPCCR1_BT16CKS_Pos)
#define    FL_CMU_BSTIM16_CLK_SOURCE_RCLP                         (0x2U << CMU_OPCCR1_BT16CKS_Pos)
#define    FL_CMU_BSTIM16_CLK_SOURCE_RCLF                         (0x3U << CMU_OPCCR1_BT16CKS_Pos)


#define    FL_CMU_BSTIM32_CLK_SOURCE_APBCLK                       (0x0U << CMU_OPCCR1_BT32CKS_Pos)
#define    FL_CMU_BSTIM32_CLK_SOURCE_LSCLK                        (0x1U << CMU_OPCCR1_BT32CKS_Pos)
#define    FL_CMU_BSTIM32_CLK_SOURCE_RCLP                         (0x2U << CMU_OPCCR1_BT32CKS_Pos)
#define    FL_CMU_BSTIM32_CLK_SOURCE_RCLF                         (0x3U << CMU_OPCCR1_BT32CKS_Pos)


#define    FL_CMU_LPTIM16_CLK_SOURCE_APBCLK                       (0x0U << CMU_OPCCR1_LPT16CKS_Pos)
#define    FL_CMU_LPTIM16_CLK_SOURCE_LSCLK                        (0x1U << CMU_OPCCR1_LPT16CKS_Pos)
#define    FL_CMU_LPTIM16_CLK_SOURCE_RCLP                         (0x2U << CMU_OPCCR1_LPT16CKS_Pos)
#define    FL_CMU_LPTIM16_CLK_SOURCE_RCLF                         (0x3U << CMU_OPCCR1_LPT16CKS_Pos)


#define    FL_CMU_LPTIM32_CLK_SOURCE_APBCLK                       (0x0U << CMU_OPCCR1_LPT32CKS_Pos)
#define    FL_CMU_LPTIM32_CLK_SOURCE_LSCLK                        (0x1U << CMU_OPCCR1_LPT32CKS_Pos)
#define    FL_CMU_LPTIM32_CLK_SOURCE_RCLP                         (0x2U << CMU_OPCCR1_LPT32CKS_Pos)
#define    FL_CMU_LPTIM32_CLK_SOURCE_RCLF                         (0x3U << CMU_OPCCR1_LPT32CKS_Pos)


#define    FL_CMU_ATIM_CLK_SOURCE_APBCLK                          (0x0U << CMU_OPCCR1_ATCKS_Pos)
#define    FL_CMU_ATIM_CLK_SOURCE_PLL_X2                          (0x1U << CMU_OPCCR1_ATCKS_Pos)


#define    FL_CMU_CAN_CLK_SOURCE_RCHF                             (0x0U << CMU_OPCCR1_CANCKS_Pos)
#define    FL_CMU_CAN_CLK_SOURCE_XTHF                             (0x1U << CMU_OPCCR1_CANCKS_Pos)
#define    FL_CMU_CAN_CLK_SOURCE_PLL                              (0x2U << CMU_OPCCR1_CANCKS_Pos)
#define    FL_CMU_CAN_CLK_SOURCE_APBCLK                           (0x3U << CMU_OPCCR1_CANCKS_Pos)


#define    FL_CMU_UART1_CLK_SOURCE_APBCLK                         (0x0U << CMU_OPCCR1_UART1CKS_Pos)
#define    FL_CMU_UART1_CLK_SOURCE_RCHF                           (0x1U << CMU_OPCCR1_UART1CKS_Pos)
#define    FL_CMU_UART1_CLK_SOURCE_SYSCLK                         (0x2U << CMU_OPCCR1_UART1CKS_Pos)
#define    FL_CMU_UART1_CLK_SOURCE_XTHF                           (0x3U << CMU_OPCCR1_UART1CKS_Pos)


#define    FL_CMU_UART0_CLK_SOURCE_APBCLK                         (0x0U << CMU_OPCCR1_UART0CKS_Pos)
#define    FL_CMU_UART0_CLK_SOURCE_RCHF                           (0x1U << CMU_OPCCR1_UART0CKS_Pos)
#define    FL_CMU_UART0_CLK_SOURCE_SYSCLK                         (0x2U << CMU_OPCCR1_UART0CKS_Pos)
#define    FL_CMU_UART0_CLK_SOURCE_XTHF                           (0x3U << CMU_OPCCR1_UART0CKS_Pos)


